Документация/ab_test_4
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        gunicorn/19.0.0
Server Hostname:        localhost
Server Port:            80

Document Path:          /question/1/
Document Length:        5777 bytes

Concurrency Level:      1
Time taken for tests:   189.327 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      5983000 bytes
HTML transferred:       5777000 bytes
Requests per second:    5.28 [#/sec] (mean)
Time per request:       189.327 [ms] (mean)
Time per request:       189.327 [ms] (mean, across all concurrent requests)
Transfer rate:          30.86 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       6
Processing:     0  192  45.4    167     398
Waiting:        0  191  44.2    166     390
Total:          0  192  45.5    167     399

Percentage of the requests served within a certain time (ms)
  50%    167
  66%    207
  75%    233
  80%    241
  90%    259
  95%    272
  98%    285
  99%    298
 100%    399 (longest request)