Документация/ab_test_5
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        gunicorn/19.0.0
Server Hostname:        localhost
Server Port:            80

Document Path:          /register/
Document Length:        4850 bytes

Concurrency Level:      1
Time taken for tests:   117.328 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      5177000 bytes
HTML transferred:       4850000 bytes
Requests per second:    8.52 [#/sec] (mean)
Time per request:       117.328 [ms] (mean)
Time per request:       117.328 [ms] (mean, across all concurrent requests)
Transfer rate:          43.09 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       9
Processing:     0  119  29.0    102     313
Waiting:        0  117  28.1    101     307
Total:          0  119  29.1    102     313

Percentage of the requests served within a certain time (ms)
  50%    102
  66%    124
  75%    143
  80%    149
  90%    162
  95%    174
  98%    187
  99%    194
 100%    313 (longest request)